src/cf/DataProcessors/GDS_ПечатьЗапровочныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>GDS_ПечатьЗапровочныхВедомостей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВедомости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ТипыЗаправочныхВедомостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/GDS_ПечатьЗапровочныхВедомостей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
//	
//	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаправочнаяВедомость") Тогда
//		СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "ЗаправочнаяВедомость", "Заправочная ведомость",
//			ОбъектыПечати, ПараметрыВывода);
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПечатнуюФорму(ДанныеОбработки) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ДанныеПечати = ДанныеПечати(ДанныеОбработки.АЗС, ДанныеОбработки.Контрагент);
	
	Для Каждого СтрокаПечати Из ДанныеПечати Цикл
		
		ДанныеПечатиВедомости = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаПечати);
		
		Макет = ПолучитьМакет("Ведомость");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(ДанныеПечатиВедомости);
		
		ДанныеQR = Новый Структура;
		ДанныеQR.Вставить("АЗС", Строка(СтрокаПечати.АЗСУИН));
		ДанныеQR.Вставить("Контрагент", Строка(СтрокаПечати.КонтрагентУИН));
		ДанныеQR.Вставить("ТипВедомости", Строка(ДанныеОбработки.ТипВедомости));
		
		QRСтрока = ОбщегоНазначения.ЗначениеВJSON(ДанныеQR);
		
		ДвоичныеДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
		
		ОбластьРисунка = ОбластьШапка.Области.Найти("РисунокQR");
		ОбластьРисунка.Картинка = Новый Картинка(ДвоичныеДанныеQRКода);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Для НомерСтроки = 1 По 17 Цикл
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечати(АЗС, Контрагент)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("АЗС", АЗС);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатАЗС.Представление КАК АЗС,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(уатАЗС.Ссылка) КАК АЗСУИН,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК КонтрагентУИН,
	|	Контрагенты.Наименование КАК Контрагент
	|ИЗ
	|	Справочник.уатАЗС КАК уатАЗС,
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|	И уатАЗС.Ссылка = &АЗС";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
